In [2]:
from random import sample
from datetime import date, datetime
from pydbgen import pydbgen
import pandas as pd
import numpy as np 
import random

In [3]:
list = [1,2,3,4,5]
print(sample(list, 5))

[1, 3, 4, 2, 5]

# Country and City

In [9]:
country_city = pd.read_csv('worldcities.csv')
country_city_df = country_city[['city', 'country']]
country_city_df = country_city_df.sample(250, random_state = 1)
country_city_df

                 city         country
39956  Schuyler Falls   United States
4158     Punta Arenas           Chile
15012   Saint-Raphaël          France
32253      Guimarânia          Brazil
7390            Mosta           Malta
...               ...             ...
2685         Babruysk         Belarus
23451       Mittweida         Germany
8373             Kumi          Uganda
14151          Tipton  United Kingdom
33216       Southwell  United Kingdom

[250 rows x 2 columns]

# Height

In [15]:
height = np.round(np.random.normal(1.70, 0.1, 250),2)
weight = np.round(np.random.normal(60, 10, 250), 1)
height = pd.DataFrame(height, columns = ['Height'])
weight = pd.DataFrame(weight, columns = ['Weight'])
height_weight = pd.concat([height, weight], axis = 1)
height_weight

     Height  Weight
0      1.60    74.4
1      1.69    73.3
2      1.77    48.7
3      1.51    58.2
4      1.73    61.6
..      ...     ...
245    1.62    66.7
246    1.58    51.1
247    1.50    62.2
248    1.65    62.1
249    1.90    57.1

[250 rows x 2 columns]